let questions = [
    {
        "question":"假如你成爲了一名偶像，你最無法忍受瘋狂粉絲的哪一種行爲？",
        "answers":[
            ["騷擾你的朋友和家人",2],
            ["以捍衛之名挑起你與其他偶像的戰爭",3],
            
        ]
    },
    {
        "question":"你如何看待觀點「不做獵人，便爲獵物」？",
        "answers":[
            ["基本贊同",3],
            ["不太贊同",4],
            
        ]
    },
    {
        "question":"如果需要獨自在國外某個城市生活一年，你會選擇哪一份工作？",
        "answers":[
            ["咖啡師",4],
            ["語言教師",5],
            ["房屋仲介",4],
            ["設計師助理",5]
        ]
    },
    {
        "question":"你是否喜歡被別人需要和依賴的感覺？",
        "answers":[
            ["是",5],
            ["否",6],
           
        ]
    },
    {
        "question":"和朋友或戀人意見不同甚至爭吵時，你更擔心的是？",
        "answers":[
            ["陷入冷戰，彼此不說話",7],
            ["情緒失控，互相進行言語傷害",6],
           
        ]
    },
    {
        "question":"假如你是一名偶像練習生，在訓練過程中，你更可能會？",
        "answers":[
            ["害怕和各種前輩、領導打交道",7],
            ["對反覆的訓練感到枯燥和厭煩",8],
            
        ]
    },
    {
        "question":"拒絕他人的請求會讓你感到窘迫甚至愧疚嗎？",
        "answers":[
            ["是",8],
            ["否",9],
            
        ]
    },
    {
        "question":"你更喜愛的是：",
        "answers":[
            ["社交和分享",9],
            ["個人的空間",10],
            
        ]
    },
    {
        "question":"你更無法接受哪一款戀人？",
        "answers":[
            ["沒主見，凡事都聽父母的話",11],
            ["脾氣火爆，一點就著",10],
            ["熱愛社交和聚會，異性朋友多",10],
            ["控制慾強，不允許你和異性說話",11]
        ]
    },
    {
        "question":"即便他人傷害了你，你也不願意去怨恨嗎？",
        "answers":[
            ["是",12],
            ["否",11]
            
        ]
    },
    {
        "question":"假如女性朋友被一個渣男欺騙感情，你更可能會？",
        "answers":[
            ["陪她走出失戀陰霾","C"],
            ["找渣男討回公道","A"]
            
        ]
    },
    {
        "question":"如果要給身爲偶像的自己選擇一個助理，你會選擇？",
        "answers":[
            ["助理A:經驗豐富，脾氣暴躁","D"],
            ["助理B:沒有經驗，單純親切","B"]
            
        ]
    }
    
];

let finalAnswers={
        "A":["Jisoo","你就像BLACKPINK裡的Jisoo~<br>和她相似的是，你們都有著一顆包容、有擔當的心，不喜好爭執，也不願去怨恨他人。可能你並不擅長說讓人心醉的甜蜜言語，但卻總能以最真實的行動照顧身邊人，爲他們帶來最溫暖的力量。"],
        "B":["Jennie","你就像BLACKPINK裡的Jennie~<br>和她相似的是，你們都是生動有趣的、純真的、迷人的，仿佛天生帶有一盞“聚光燈”，能夠吸引所有人的目光。再加上坦率的性情、機靈的頭腦，可以說非常具有人格魅力。"],
        "C":["Rosé","你就像BLACKPINK裡的ROSé~<br>和她相似的是，你同樣堅強、獨立，對自我有著很清醒的認知，知道自己想要什麽並願爲之所努力。對待親人和朋友，你總擺出完全信賴的姿態，也願意在他們需要幫助時全力以赴。"],
        "D":["Lisa","你就像BLACKPINK裡的Lisa~<br>和她相似的是，你富有智慧、善于自省、行動力強，對于新的環境、新的階段，你總能及時調整自己的狀態，快速地適應並融入其中，這也讓你看上去像一個“風風火火”的小超人，但實際上，你也有著柔情、溫暖的一面。"]
};